servicemix-components/src/test/resources/org/apache/servicemix/components/http/soap-response.xml

<?xml version="1.0" encoding="UTF-8"?>
<e:Envelope xmlns:e="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:d="http://www.w3.org/2001/XMLSchema"
xmlns:i="http://www.w3.org/2001/XMLSchema-instance"
xmlns:wn0="http://systinet.com/xsd/SchemaTypes/"
xmlns:wn1="http://systinet.com/wsdl/com/cexp/coe/bob/ws/customer/"
xmlns:wn2="http://systinet.com/soap-jta/"
xmlns:wn3="http://systinet.com/wsdl/com/cexp/coe/bob/services/order/pojo/">
  <e:Body>
    <wn1:getCustomerInfo>
      <wn1:userId i:type="d:string">akayali</wn1:userId>
    </wn1:getCustomerInfo>
  </e:Body>
</e:Envelope>
